---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SurfaceResolutionOutOfRange
source: html/3f87d115-6b71-9ffa-67f6-b274d46fd0f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SurfaceResolutionOutOfRange Property

Pixel size is out of range.

## Syntax (C#)
```csharp
public static FailureDefinitionId SurfaceResolutionOutOfRange { get; }
```